
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Состояние(
		СтрШаблон(
			НСтр("ru = '%1 начат обмен данными с инетрнет-магазином'"),
			Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДЛФ=DT")));
			
	ВыполнитьОбменСервер();
	
	Состояние(
		СтрШаблон(
			НСтр("ru = '%1 обмен данными с инетрнет-магазином завершен'"),
			Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДЛФ=DT")));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьОбменСервер()

	OS_ОбменСИнтернетМагазином.ВыполнитьОбмен();
	
КонецПроцедуры

#КонецОбласти
