#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Не ЭтотУзел Тогда
		
		Если Не ЗначениеЗаполнено(Наименование) Тогда
			Наименование = "Интернет-магазин";
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Код) Тогда
			Код = Новый УникальныйИдентификатор();
		КонецЕсли;
		
		ГлавныйУзел = ПланыОбмена.OS_ОбменСИнтернетМагазином.ЭтотУзел().ПолучитьОбъект();
		МодифицированностьГлавногоУзла = Ложь;
		Если Не ЗначениеЗаполнено(ГлавныйУзел.Наименование) Тогда
			ГлавныйУзел.Наименование = "Текущая информационная база";
			МодифицированностьГлавногоУзла = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ГлавныйУзел.Код) Тогда
			ГлавныйУзел.Код = Новый УникальныйИдентификатор();
			МодифицированностьГлавногоУзла = Истина;
		КонецЕсли;
		
		Если МодифицированностьГлавногоУзла Тогда
			ГлавныйУзел.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
