
&НаКлиенте
Процедура ЗапросПокупатели(Команда)
	
	ЗапросПокупателиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗапросПокупателиНаСервере()
	
	Запрос = Новый HTTPЗапрос("/");
	Запрос.УстановитьТелоИзСтроки(ТекстЗапроса);
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	OS_ОбменСИнтернетМагазином.ОбработатьЗапрос_Покупатели(Запрос, Отказ, ОписаниеОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросЗаказы(Команда)
	
	ЗапросЗаказыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗапросЗаказыНаСервере()
	
	Запрос = Новый HTTPЗапрос("/");
	Запрос.УстановитьТелоИзСтроки(ТекстЗапроса);
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	OS_ОбменСИнтернетМагазином.ОбработатьЗапрос_Заказы(Запрос, Отказ, ОписаниеОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросСтатусы(Команда)
	ЗапросСтатусыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапросСтатусыНаСервере()
	
	Запрос = Новый HTTPЗапрос("/");
	Запрос.УстановитьТелоИзСтроки(ТекстЗапроса);
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	OS_ОбменСИнтернетМагазином.ОбработатьЗапрос_Статусы(Запрос, Отказ, ОписаниеОшибки);
	
КонецПроцедуры


