
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	УзелОбмена = ПолучитьУзелОбмена();
	
	ПараметрыФормы = Новый Структура("Ключ", УзелОбмена);
	ОткрытьФорму("ПланОбмена.OS_ОбменСИнтернетМагазином.Форма.ФормаУзла",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьУзелОбмена()
	
	Возврат OS_ОбменСИнтернетМагазином.ПараметрыУзлаОбмена().УзелОбмена;
	
КонецФункции
