
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверкаПодключения(Команда)
	
	Если ПроверкаПодключенияВыполняется() Тогда
		ПоказатьПредупреждение(, "Проверка выполнена успешно");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИспользоватьОбменСИнтернетМагазиномПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Если Форма.Объект.ЭтотУзел Тогда
		Форма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Форма.Элементы.НастройкиПодключения.ТолькоПросмотр = Не Форма.Объект.ИспользоватьОбменСИнтернетМагазином;
	Форма.Элементы.ПроверкаПодключения.Доступность = Форма.Объект.ИспользоватьОбменСИнтернетМагазином;
	
КонецПроцедуры

&НаСервере
Функция ПроверкаПодключенияВыполняется()
	
	ПодключениеДоступно = Ложь;
	
	ПараметрыУзла = Новый Структура;
	ПараметрыУзла.Вставить("УзелОбмена", Объект.Ссылка);
	ПараметрыУзла.Вставить("ИспользоватьОбмен", Объект.ИспользоватьОбменСИнтернетМагазином);
	ПараметрыУзла.Вставить("СтрокаПодключения", Объект.СтрокаПодключения);
	ПараметрыУзла.Вставить("КлючДоступа", Объект.КлючДоступа);
	
	OS_ОбменСИнтернетМагазином.ПроверитьПодключение(ПодключениеДоступно, ПараметрыУзла);
	
	Возврат ПодключениеДоступно;
	
КонецФункции

#КонецОбласти
