
Функция ТестGET(Запрос)
	
	// Тестирование соединения
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("OK");
	Возврат Ответ;
	
КонецФункции

Функция ПокупателиPOST(Запрос)
	
	Отказ = Ложь;
	ТекстОшибки = "";
	OS_ОбменСИнтернетМагазином.ОбработатьЗапрос_Покупатели(Запрос, Отказ, ТекстОшибки);
	
	Ответ = Новый HTTPСервисОтвет(200); // ОК
	Если Не Отказ Тогда
		Ответ.УстановитьТелоИзСтроки("OK");
	Иначе
		Ответ.УстановитьТелоИзСтроки(ТекстОшибки);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ЗаказыPOST(Запрос)
	
	Отказ = Ложь;
	ТекстОшибки = "";
	OS_ОбменСИнтернетМагазином.ОбработатьЗапрос_Заказы(Запрос, Отказ, ТекстОшибки);
	
	Ответ = Новый HTTPСервисОтвет(200); // ОК
	Если Не Отказ Тогда
		Ответ.УстановитьТелоИзСтроки("OK");
	Иначе
		Ответ.УстановитьТелоИзСтроки(ТекстОшибки);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция СтатусыPOST(Запрос)
	
	Отказ = Ложь;
	ТекстОшибки = "";
	OS_ОбменСИнтернетМагазином.ОбработатьЗапрос_Статусы(Запрос, Отказ, ТекстОшибки);
	
	Ответ = Новый HTTPСервисОтвет(200); // ОК
	Если Не Отказ Тогда
		Ответ.УстановитьТелоИзСтроки("OK");
	Иначе
		Ответ.УстановитьТелоИзСтроки(ТекстОшибки);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции
